
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_resource_group.rg
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.key-vault.azurerm_key_vault_access_policy.developer[0]
  * module.key-vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.key-vault.azurerm_user_assigned_identity.managed_identity[0]
* Replace
  * module.postgresql_v15.null_resource.set-user-permissions-additionaldbs[&#34;ccd_definition_store&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ccd-shared-aat"
      + tags     = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-definition-store-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }
    }

  # module.key-vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "ccd-aat"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "ccd-shared-aat"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-definition-store-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + contact {
          + email = (known after apply)
          + name  = (known after apply)
          + phone = (known after apply)
        }

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key-vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key-vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key-vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7df9d173-631b-47a6-8737-0f15616d25f0"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "ccd-aat"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }

      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.key-vault.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ccd-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-definition-store-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }
      + tenant_id           = (known after apply)
    }

  # module.postgresql_v15.null_resource.set-user-permissions-additionaldbs["ccd_definition_store"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "6830129984905919089" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "force_trigger"  = "" -> "1"
            # (3 unchanged elements hidden)
        }
    }

Plan: 9 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1463,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->